//++ Захаров №1 20.12.2023 Дополнение форм новыми элементами
Процедура ПриСозданииНаСервере(Форма) Экспорт 
	
	ИмяФормы = Форма.ИмяФормы;
	Элементы = Форма.Элементы;
	Команды = Форма.Команды;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента"
		ИЛИ ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента"
		ИЛИ ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента"
		ИЛИ ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента"
		ИЛИ ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда 
		
		НовыйЭлемент = Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"));
		НовыйЭлемент.ПутьКДанным = "Объект.КонтактноеЛицо";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента"
			ИЛИ ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента"
			ИЛИ ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда			
			Элементы.Переместить(НовыйЭлемент, Элементы.ГруппаШапкаПраво);
		ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда 
			Элементы.Переместить(НовыйЭлемент, Форма, Элементы.Основание);
		ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
			Элементы.Переместить(НовыйЭлемент, Форма, Элементы.СуммаДокумента);
		КонецЕсли;
		
		Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда 
			НовыйЭлемент = Элементы.Добавить("Скидка", Тип("ПолеФормы"), Элементы.ГруппаШапкаЛево);
			НовыйЭлемент.ПутьКДанным = "Объект.мз_Скидка";
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;		
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "мз_Подключаемый_СкидкаПриИзменении");
			
			НоваяКоманда = Команды.Добавить("ПересчетСУчетомСкидки");
			НоваяКоманда.Действие = "мз_ПодключаекмыйПересчитатьСУчетомСкидки";
			
			НовыйЭлемент = Элементы.Добавить("ПересчитатьСУчетомСкидки", Тип("КнопкаФормы"), Элементы.ГруппаШапкаЛево);
			НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
			НовыйЭлемент.ИмяКоманды = "ПересчетСУчетомСкидки";
			НовыйЭлемент.Заголовок = "Пересчитать с учетом скидки";
			
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры
//-- Захаров